from .base import FunctionalTest


class TestItemValidation(FunctionalTest):
    def test_cannot_add_empty_list_items(self) -> None:
        # Эдит открывает домашнюю страницу и случайно пытается отправить пустой элемент списка

        # Домашняя страница обновляется, и появляется сообщение об ошибке, которое гласит,
        # что элементы списка не должны совпадать

        # Она отправляет корректный элемент, и все срабатывает

        # Эдит пытается еще раз отправить пустой элемент, однако сайт ее снова предупреждает об ошибке
        pass