import unittest

from selenium import webdriver


class NewVisitorTest(unittest.TestCase):

    def setUp(self) -> None:
        self._browser = webdriver.Firefox()

    def tearDown(self) -> None:
        self._browser.quit()

    def test_can_start_a_list_and_retrieve_it_later(self) -> None:
        # Эдит слышала про крутое web приложение, напоминающее список неотложных дел
        # Она заходит на главную страницу и видит, что заголовок сайта говорит ей о списках неотложных дел
        self._browser.get('http://d-webserver')
        self.assertIn('To-Do List', self._browser.title)
        self.fail('End test')

        # Ей сразу же предлагается ввести элемент списка

        # Она набирает в текстовом поле "Купить павлиньи перья (ее хобби - вязание рыболовных мушек)"

        # Когда она нажимает enter, страница обновляется, и теперь страница содержит
        # "1: Купить павлиньи перья" в качестве элемента списка

        # Текстовое поле по-прежнему приглашает ее добавить еще один элемент
        # Она вводит "Сделать мушку из павлиньих перьев (Эдит очень методична)"

        # Страница снова обновляется и теперь Эдит видит оба элемента ее списка

        # Эдит интересно, запомнит ли сайт ее список. Далее она видит, что сайт сгенерировал для нее уникальный URL-адрес -
        # об этом выводится небольшой текст с пояснениями

        # Она посещает этот адрес, ее список по-прежнему там
        # Удовлетворенная, она снова ложится спать


if __name__ == '__main__':
    unittest.main()
